siva100403/CHEWIE_ASBV21/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for GPIO0: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for GPIO2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio2);
    /* Enables the clock for GPIO3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio3);
    /* Enables the clock for GPIO4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio4);
    /* Enables the clock for INPUTMUX: Enables clock */
    CLOCK_EnableClock(kCLOCK_InputMux0);
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);
    /* Enables the clock for PORT4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port4);

    gpio_pin_config_t ASB_HMI_INT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 86)  */
    GPIO_PinInit(BOARD_INITPINS_ASB_HMI_INT_GPIO, BOARD_INITPINS_ASB_HMI_INT_PIN, &ASB_HMI_INT_config);

    gpio_pin_config_t TCA9803_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 87)  */
    GPIO_PinInit(BOARD_INITPINS_TCA9803_EN_GPIO, BOARD_INITPINS_TCA9803_EN_PIN, &TCA9803_EN_config);

    gpio_pin_config_t LED_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 90)  */
    GPIO_PinInit(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN, &LED_B_config);

    gpio_pin_config_t LED_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 91)  */
    GPIO_PinInit(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN, &LED_G_config);

    gpio_pin_config_t LED_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 92)  */
    GPIO_PinInit(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN, &LED_R_config);

    gpio_pin_config_t CAMERA_PWDN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin 93)  */
    GPIO_PinInit(BOARD_INITPINS_CAMERA_PWDN_GPIO, BOARD_INITPINS_CAMERA_PWDN_PIN, &CAMERA_PWDN_config);

    gpio_pin_config_t CAMERA_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin 94)  */
    GPIO_PinInit(BOARD_INITPINS_CAMERA_RST_GPIO, BOARD_INITPINS_CAMERA_RST_PIN, &CAMERA_RST_config);

    gpio_pin_config_t TDC_CHSEL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_15 (pin 8)  */
    GPIO_PinInit(BOARD_INITPINS_TDC_CHSEL_GPIO, BOARD_INITPINS_TDC_CHSEL_PIN, &TDC_CHSEL_config);

    gpio_pin_config_t TDC_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_30 (pin 10)  */
    GPIO_PinInit(BOARD_INITPINS_TDC_RESET_GPIO, BOARD_INITPINS_TDC_RESET_PIN, &TDC_RESET_config);

    gpio_pin_config_t TDC_TRIGGER_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_31 (pin 11)  */
    GPIO_PinInit(BOARD_INITPINS_TDC_TRIGGER_GPIO, BOARD_INITPINS_TDC_TRIGGER_PIN, &TDC_TRIGGER_config);

    gpio_pin_config_t TDC1_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_0 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_TDC1_EN_GPIO, BOARD_INITPINS_TDC1_EN_PIN, &TDC1_EN_config);

    gpio_pin_config_t TDC2_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_1 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_TDC2_EN_GPIO, BOARD_INITPINS_TDC2_EN_PIN, &TDC2_EN_config);

    gpio_pin_config_t LID_ONOFF_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_3 (pin 17)  */
    GPIO_PinInit(BOARD_INITPINS_LID_ONOFF_CTRL_GPIO, BOARD_INITPINS_LID_ONOFF_CTRL_PIN, &LID_ONOFF_CTRL_config);

    gpio_pin_config_t SPARE2_CTRL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_4 (pin 18)  */
    GPIO_PinInit(BOARD_INITPINS_SPARE2_CTRL_GPIO, BOARD_INITPINS_SPARE2_CTRL_PIN, &SPARE2_CTRL_config);

    gpio_pin_config_t TDC_ERR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_5 (pin 19)  */
    GPIO_PinInit(BOARD_INITPINS_TDC_ERR_GPIO, BOARD_INITPINS_TDC_ERR_PIN, &TDC_ERR_config);

    gpio_pin_config_t SLEEP_DRV8912_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_6 (pin 20)  */
    GPIO_PinInit(BOARD_INITPINS_SLEEP_DRV8912_GPIO, BOARD_INITPINS_SLEEP_DRV8912_PIN, &SLEEP_DRV8912_config);

    gpio_pin_config_t FAULT_DRV8912_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_7 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_FAULT_DRV8912_GPIO, BOARD_INITPINS_FAULT_DRV8912_PIN, &FAULT_DRV8912_config);

