siva100403/CHEWIE_ASBV21/board/pin_mux.c
    /* PORT1_15 (pin 8) is configured as PIO1_15 */
    PORT_SetPinMux(BOARD_INITPINS_TDC_CHSEL_PORT, BOARD_INITPINS_TDC_CHSEL_PIN, kPORT_MuxAlt0);

    PORT1->PCR[15] = ((PORT1->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_2 (pin 94) is configured as PIO1_2 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_RST_PORT, BOARD_INITPINS_CAMERA_RST_PIN, kPORT_MuxAlt0);

    PORT1->PCR[2] = ((PORT1->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_3 (pin 95) is configured as CT1_MAT1 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_LED_PORT, BOARD_INITPINS_CAMERA_LED_PIN, kPORT_MuxAlt4);

    PORT1->PCR[3] = ((PORT1->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_30 (pin 10) is configured as PIO1_30 */
    PORT_SetPinMux(BOARD_INITPINS_TDC_RESET_PORT, BOARD_INITPINS_TDC_RESET_PIN, kPORT_MuxAlt0);

    PORT1->PCR[30] = ((PORT1->PCR[30] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_31 (pin 11) is configured as PIO1_31 */
    PORT_SetPinMux(BOARD_INITPINS_TDC_TRIGGER_PORT, BOARD_INITPINS_TDC_TRIGGER_PIN, kPORT_MuxAlt0);

    PORT1->PCR[31] = ((PORT1->PCR[31] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_4 (pin 97) is configured as SMARTDMA_PIO0 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_D0_PORT, BOARD_INITPINS_CAMERA_D0_PIN, kPORT_MuxAlt7);

    PORT1->PCR[4] = ((PORT1->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_5 (pin 98) is configured as SMARTDMA_PIO1 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_D1_PORT, BOARD_INITPINS_CAMERA_D1_PIN, kPORT_MuxAlt7);

    PORT1->PCR[5] = ((PORT1->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_6 (pin 99) is configured as SMARTDMA_PIO2 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_D2_PORT, BOARD_INITPINS_CAMERA_D2_PIN, kPORT_MuxAlt7);

    PORT1->PCR[6] = ((PORT1->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_7 (pin 100) is configured as SMARTDMA_PIO3 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_D3_PORT, BOARD_INITPINS_CAMERA_D3_PIN, kPORT_MuxAlt7);

    PORT1->PCR[7] = ((PORT1->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_8 (pin 1) is configured as SMARTDMA_PIO4 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_D4_PORT, BOARD_INITPINS_CAMERA_D4_PIN, kPORT_MuxAlt7);

    PORT1->PCR[8] = ((PORT1->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_9 (pin 2) is configured as SMARTDMA_PIO5 */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_D5_PORT, BOARD_INITPINS_CAMERA_D5_PIN, kPORT_MuxAlt7);

    PORT1->PCR[9] = ((PORT1->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_0 (pin 14) is configured as PIO2_0 */
    PORT_SetPinMux(BOARD_INITPINS_TDC1_EN_PORT, BOARD_INITPINS_TDC1_EN_PIN, kPORT_MuxAlt0);

    PORT2->PCR[0] = ((PORT2->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_1 (pin 15) is configured as PIO2_1 */
    PORT_SetPinMux(BOARD_INITPINS_TDC2_EN_PORT, BOARD_INITPINS_TDC2_EN_PIN, kPORT_MuxAlt0);

    PORT2->PCR[1] = ((PORT2->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_2 (pin 16) is configured as CLKOUT */
    PORT_SetPinMux(BOARD_INITPINS_CAMERA_MCLK_PORT, BOARD_INITPINS_CAMERA_MCLK_PIN, kPORT_MuxAlt1);

    PORT2->PCR[2] = ((PORT2->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_3 (pin 17) is configured as PIO2_3 */
    PORT_SetPinMux(BOARD_INITPINS_LID_ONOFF_CTRL_PORT, BOARD_INITPINS_LID_ONOFF_CTRL_PIN, kPORT_MuxAlt0);

    PORT2->PCR[3] = ((PORT2->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_4 (pin 18) is configured as PIO2_4 */
    PORT_SetPinMux(BOARD_INITPINS_SPARE2_CTRL_PORT, BOARD_INITPINS_SPARE2_CTRL_PIN, kPORT_MuxAlt0);

